4ms/metamodule/firmware/lib/stm32-usb-host-lib/Core/Src/usbh_core.c
      /* Wait for 100 ms after Reset */
      USBH_Delay(100U);

      phost->device.speed = (uint8_t)USBH_LL_GetSpeed(phost);

      phost->gState = HOST_ENUMERATION;

      phost->Control.pipe_out = USBH_AllocPipe(phost, 0x00U);
      phost->Control.pipe_in  = USBH_AllocPipe(phost, 0x80U);

      /* Open Control pipes */
      (void)USBH_OpenPipe(phost, phost->Control.pipe_in, 0x80U,
                          phost->device.address, phost->device.speed,
                          USBH_EP_CONTROL, (uint16_t)phost->Control.pipe_size);

      /* Open Control pipes */
      (void)USBH_OpenPipe(phost, phost->Control.pipe_out, 0x00U,
                          phost->device.address, phost->device.speed,
                          USBH_EP_CONTROL, (uint16_t)phost->Control.pipe_size);

#if (USBH_USE_OS == 1U)
      phost->os_msg = (uint32_t)USBH_PORT_EVENT;
#if (osCMSIS < 0x20000U)
      (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
      (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif
      break;

    case HOST_ENUMERATION:
      /* Check for enumeration status */
      status = USBH_HandleEnum(phost);
      if (status == USBH_OK)
      {
        /* The function shall return USBH_OK when full enumeration is complete */
        USBH_UsrLog("Enumeration done.");

        phost->device.current_interface = 0U;

        if (phost->device.DevDesc.bNumConfigurations == 1U)
        {
          USBH_UsrLog("This device has only 1 configuration.");
          phost->gState = HOST_SET_CONFIGURATION;
        }
        else
        {
          phost->gState = HOST_INPUT;
        }
#if (USBH_USE_OS == 1U)
        phost->os_msg = (uint32_t)USBH_STATE_CHANGED_EVENT;
#if (osCMSIS < 0x20000U)
        (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
        (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif
      }
      break;

    case HOST_INPUT:
    {
      /* user callback for end of device basic enumeration */
      if (phost->pUser != NULL)
      {
        phost->pUser(phost, HOST_USER_SELECT_CONFIGURATION);
        phost->gState = HOST_SET_CONFIGURATION;

#if (USBH_USE_OS == 1U)
        phost->os_msg = (uint32_t)USBH_STATE_CHANGED_EVENT;
#if (osCMSIS < 0x20000U)
        (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
        (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif
      }
    }
    break;

    case HOST_SET_CONFIGURATION:
      /* set configuration */
      if (USBH_SetCfg(phost, (uint16_t)phost->device.CfgDesc.bConfigurationValue) == USBH_OK)
      {
        phost->gState = HOST_SET_WAKEUP_FEATURE;
        USBH_UsrLog("Default configuration set.");
      }

#if (USBH_USE_OS == 1U)
      phost->os_msg = (uint32_t)USBH_PORT_EVENT;
#if (osCMSIS < 0x20000U)
      (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
      (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif
      break;

    case  HOST_SET_WAKEUP_FEATURE:

      if (((phost->device.CfgDesc.bmAttributes) & (1U << 5)) != 0U)
      {
        status = USBH_SetFeature(phost, FEATURE_SELECTOR_REMOTEWAKEUP);

        if (status == USBH_OK)
        {
          USBH_UsrLog("Device remote wakeup enabled");
          phost->gState = HOST_CHECK_CLASS;
        }
        else if (status == USBH_NOT_SUPPORTED)
        {
          USBH_UsrLog("Remote wakeup not supported by the device");
          phost->gState = HOST_CHECK_CLASS;
        }
        else
        {
          /* .. */
        }
      }
      else
      {
        phost->gState = HOST_CHECK_CLASS;
      }

#if (USBH_USE_OS == 1U)
      phost->os_msg = (uint32_t)USBH_PORT_EVENT;
#if (osCMSIS < 0x20000U)
      (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
      (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif
      break;

    case HOST_CHECK_CLASS:

      if (phost->ClassNumber == 0U)
      {
        USBH_UsrLog("No Class has been registered.");
      }
      else
      {
        phost->pActiveClass = NULL;

        /* Try each registered class in registration order. A class is a
           candidate if some interface matches its ClassCode and SubClassCode
           (0 = any subclass) and has endpoints. If a candidate's Init fails,
           clean up and try the next registered class instead of aborting. */
        for (idx = 0U; (idx < USBH_MAX_NUM_SUPPORTED_CLASS) && (phost->pActiveClass == NULL); idx++)
        {
          uint8_t class_matches = 0U;

          if (phost->pClass[idx] == NULL)
          {
            continue;
          }

          USBH_UsrLog("Looking for classcode 0x%x sub-class 0x%x (%.16s)",
                      phost->pClass[idx]->ClassCode, phost->pClass[idx]->SubClassCode, phost->pClass[idx]->Name);

          /* Scan all parsed interface slots (alt settings get their own slots,
             so there can be more slots than bNumInterfaces). Slots are filled
             in order; the first zeroed slot marks the end. */
          for (unsigned itf = 0U; itf < USBH_MAX_NUM_INTERFACES; itf++)
          {
            USBH_InterfaceDescTypeDef *interface = &phost->device.CfgDesc.Itf_Desc[itf];

            if (interface->bLength == 0U)
            {
              break;
            }

            // TODO: keep a user preference table of phost->device.DevDesc.idVendor, idDevice and which itf to choose
            // Double-check the chosen itf matches, otherwise fall back to picking the first one
            // Also report back to A7 all the matching itf found

            if ((phost->pClass[idx]->ClassCode == interface->bInterfaceClass) &&
                ((phost->pClass[idx]->SubClassCode == 0U) ||
                 (phost->pClass[idx]->SubClassCode == interface->bInterfaceSubClass)))
            {
              USBH_UsrLog("Found matching interface #%u with %u endpoints", itf, interface->bNumEndpoints);
              if (interface->bNumEndpoints > 0U)
              {
                class_matches = 1U;
              }
            }
          }

          if (class_matches == 0U)
          {
            continue;
          }

          phost->pActiveClass = phost->pClass[idx];

